//一个3x3的网格，将1-9个数放入其中，使每行每列及每个对角线的值相加都相同
//sp每个数只能用一次，矩阵中心的元素是5 
#include<stdio.h>
int main(void)
{
	printf("提示：矩阵中心是数字5\n");
	int i,j;
	int a[3][3];
	printf("请往矩阵里输入数字：\n");
	for(i=0;i<3;i++)
	{
	    for(j=0;j<3;j++)
		{
			printf("a[%d][%d]=",i,j);
			scanf("%d",&a[i][j]);
		}	
	} 
	
	//判断行
	if((a[0][0]+a[0][1]+a[0][2]==15)&&(a[1][0]+a[1][1]+a[1][2]==15)&&(a[2][0]+a[2][1]+a[2][2]==15))
	{
		printf("行正确\n");
	}
	else
	{
		printf("行错误\n"); 
	}
	 
	//判断列
	if ((a[0][0]+a[1][0]+a[2][0]==15)&&(a[0][1]+a[1][1]+a[2][1]==15)&&(a[0][2]+a[1][2]+a[2][2]==15))
	{
		printf("列正确\n");
	} 
	else
	{
		printf("列错误\n");
	} 
	
	//判断对角线
	 if ((a[0][0]+a[1][1]+a[2][2]==15)&&(a[2][0]+a[1][1]+a[0][2]==15)) 
	 {
	 	printf("对角线正确\n");
	 }
	else
	{
		printf("对角线错误\n");
	}
	
	for(i=0;i<3;i++)
	{
	    for(j=0;j<3;j++)
		{
			printf("%d\t",a[i][j]);
		}
		printf("\n");	
	} 
	 
	 
	return 0;
} 
